

# g =(int(input('Сан бериниз: ')))
# def factorial(x):
#     pr = 1
#     for i in range(2,x+1):
#         pr = pr*i
#     return pr


# print('Ответ', factorial(g))



# a = int(input('Введите число: '))
# text = ''
# for i in range(a,):
#     print(a)
#      if i == a:
#         text = text + '{} = '.format(i)
#     else:
#         text = text + '{} * '.format(i)


# zaka = "Men {at}, men {jash} chyktym".format(at="Zalkarbek", jash = "19")
# zaka = "Men {0}, men {1} chyktym".format("Zalkarbek", "19")
# zaka = "Men {}, men {} chyktym".format("Zalkarbek", "19")
# print(zaka)






# def progress(num):
#     geo = 1
#     text = ''
#     for i in range(1, num + 1):
#         geo = geo * i
#         if i == num:
#             text = text + '{} = '.format(i)
#         else:
#             text = text + '{} * '.format(i)
#     print('Ответ:', text, geo)
# g = int(
#     input('Сан бериниз 1: ')
# )
# g2 = int(
#     input('Сан бериниз 2: ')
# )
# progress(g)
# progress(g2)















# Пример:
    # Ввод: image.png
    # Вывод: png

    # Ввод: Расширение не найдено
    # Вывод: mp3

    # Ввод: file
    # Вывод: Расширение не найдено
# b = 'image.png'
# e = 'music.mp3'
# q ='.mp4'
# a = input('Введите названия: ').lower()
# if a == b:
#     print('Это png')
# elif a == e:
#     print('Это mp3')
# elif a == q:
#     print('Это mp4')
# else:
#     print('Расширение не найдено')



# Задача 2:
  # Спросите у пользователя число N и верните ему число которое получилось по следующей формуле: N + N*N + N*N*N

  # Пример:
  # N = 5
  # Result: 615

def kvadrat




