 modified = '''исследователи ESET с()()бщили/ 
чт() в наст()ящее время активн()сть xDSpy прекратилась/ 
и пр()из()шл() эт() п()сле предупреждения/ ()публик()ванн()г() бел()русским cert в феврале текущег() г()да! 
П() сути/ т()гда эксперты ()бнаружили ()дну из вред()н()сных кампаний хакер()в/ к()т()рая и была детальн() ()писана в д()кументе! 
именн() инф()рмация бел()русск()г() cert стала ()тправн()й т()чк()й для начала расслед()вания eset и п()м()гла аналитикам ()бнаружить пр()шлые ()перации XDSpy!
'''
      
      
 original = '''Исследователи ESET сообщили, 
 что в настоящее время активность XDSpy прекратилась, 
и произошло это после предупреждения, опубликованного белорусским CERT в феврале текущего года. 
По сути, тогда эксперты обнаружили одну из вредоносных кампаний хакеров, которая и была детально описана в документе. 
Именно информация белорусского CERT стала отправной точкой для начала расследования ESET и помогла аналитикам обнаружить прошлые операции XDSpy.

'''
modified.upper('eset')