# post = '''Вера Павловна, 
# проснувшись, долго нежится в постели; она любит
# нежиться,
#  и немножко будто дремлет, и не дремлет, 
#  а думает, что надобно сделать; и так полежит, 
#  не дремлет, и не думает - нет,🍕 думает: 
#  "как тепло, мягко, хорошо, славно нежиться поутру"; 
#  так и нежится, пока из нейтральной комнаты, - нет, надобно сказать: 
#  одной из нейтральных комнат, теперь уже две их, ведь 🍕 это уже четвертый год замужества, - муж, 
#  то есть "миленький", говорит: "Верочка, проснулась?" - "Да, миленький".
#   🍕 Это значит, что муж может начинать делать чай: поутру он делает чай, 
#   и что Вера Павловна, - нет, в своей комнате она не Вера Павловна, а Верочка, 
#   - начинает одеваться. Как же долго она одевается! - нет, она одевается скоро,
#    в одну минуту, но она долго плещется в воде, она любит плескаться, 
#    и потом долго причесывает волосы, - нет, не причесывает долго, 
#    это она делает в одну минуту, а долго так шалит ими,
#     потому что она любит свои волосы; 🍕 впрочем, иногда долго занимается она и одною из 
# настоящих статей туалета, надеванием ботинок;
#  у ней отличные ботинки; она одевается очень скромно, но ботинки ее страсть.'''
# print(post.count('🍕'))
modified = '''исследователи ESET сffбщили/ 
чтf в настfящее время активнfсть xDSpy прекратилась/ 
и прfизfшлf этf пfсле предупреждения/ fпубликfваннfгf белfрусским cert в феврале текущегf гfда! 
Пf сути/ тfгда эксперты fбнаружили fдну из вредfнfсных кампаний хакерв/ кfтfрая и была детальнf fписана в дfкументе! 
именнf инфfрмация белfрусскfгf cert стала fтправнfй тfчкfй для начала расследfвания eset и пfмfгла аналитикам fбнаружить прfшлые fперации XDSpy!
'''

print(modified.replace('f', 'о').replace('/',','))